Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: This prevents a second click on the same column from reversing the sort direction.
ja: これにより、同じ列を2回目にクリックしても、ソートの方向が逆になることを防ぐことができます。

source: This prevents the Start Menu from appearing if the user accidentally presses Win during the send.
ja: これにより、ユーザーが送信中に誤ってWinを押してしまっても、スタートメニューが表示されないようにしました。

source: This prevents the object itself from being called as an enumerator.
ja: これにより、オブジェクト自体がEnumratorとして呼び出されなくなりました。

source: This prevents the user's keystrokes from disrupting the flow of simulated keystrokes.
ja: これにより、ユーザーのキー入力が模擬キー入力の流れを乱すことを防いでいます。

source: This prevents the user's mouse movements and clicks from disrupting the simulated mouse events.
ja: これにより、ユーザーのマウスの動きやクリックが、シミュレートされたマウスイベントを乱すことを防ぐことができます。

source: This prevents the window from overriding the action (such as to "minimize" to the taskbar by hiding the window), but may also prevent the window from responding correctly, such as to save the current focus for when the window is restored.
ja: これは、ウィンドウがアクションを上書きするのを防ぐ（ウィンドウを隠すことでタスクバーに「最小化」するなど）が、ウィンドウが復元されたときのために現在のフォーカスを保存するなど、ウィンドウが正しく応答するのを防ぐこともできる。

source: This prevents usages of Send within such a hotkey from locking the PC.
ja: これにより、このようなホットキー内で送信を使用した場合、PCがロックされるのを防ぐことができます。

source: This prevents your keystrokes from being interspersed with those of the replacement.
ja: これにより、自分のキー入力と交換者のキー入力が混在することを防ぎます。

source: This probably doesn't exist on most keyboards.
ja: これはおそらく、ほとんどのキーボードに存在しないと思われます。

source: This process is called "Scripting".
ja: このプロセスは「スクリプティング」と呼ばれています。

source: This process is quicker and more productive if you use a text editor with support for AutoHotkey.
ja: この作業は、AutoHotkeyに対応したテキストエディタを使用すれば、より早く、より生産的に行えます。

source: This property actually doesn't exist by default, but can be defined by the script.
ja: このプロパティは、実はデフォルトでは存在せず、スクリプトで定義することができます。

source: This property always returns the exact value it was given either by __New or by a previous assignment.
ja: このプロパティは常に、__Newまたは以前の割り当てによって与えられた正確な値を返します。

source: This property can be used while the Input is in progress, or after it has ended.
ja: このプロパティは、Inputの実行中、または終了後に使用することができます。

source: This property is inherited from Any; however, it can be set only for instances of Object.
ja: このプロパティはAnyから継承されますが、Objectのインスタンスに対してのみ設定することができます。

source: This property should be used only with an actual file.
ja: このプロパティは、実際のファイルに対してのみ使用する必要があります。

source: This provides more consistent results if the active window's keyboard layout is different to the script's keyboard layout.
ja: これにより、アクティブウィンドウのキーボードレイアウトがスクリプトのキーボードレイアウトと異なる場合、より一貫した結果が得られます。

source: This rarely-used method also prevents certain types of hotkeys from requiring the keyboard hook.
ja: このめったに使われない方法は、ある種のホットキーが キーボードフックを必要としないようにもします。

source: This rarely-used option has no effect on auto-replace hotstrings.
ja: このめったに使われないオプションは、自動置換ホットストリングには影響しません。

source: This rarely-used option resets the hotstring recognizer after each triggering of the hotstring.
ja: このオプションはほとんど使用されませんが、ホットストリングがトリガーされるたびに、ホットストリング認識装置をリセットします。

source: This rarely-used option sets the delay between keystrokes produced by auto-backspacing or auto-replacement.
ja: このオプションはほとんど使用されませんが、オートバックスペースやオートリプレースメントによって生じるキーストローク間の遅延を設定します。

source: This reduces the chance of interfering with messages used internally by current and future versions of AutoHotkey.
ja: これにより、AutoHotkeyの現在および将来のバージョンで内部的に使用されるメッセージに干渉する可能性を低減することができます。

source: This reduces the possibility that certain OnMessage() and GUI events will be lost due to "thread already running".
ja: これにより、特定のOnMessage()やGUIイベントが "thread already running "のために失われる可能性を減らすことができます。

source: This registers a function object to be called before any previously registered functions:
ja: 先に登録されている関数の前に呼び出される関数オブジェクトを登録します：

source: This removes the need for (built-in) workarounds relating to the dialog changing the current working directory.
ja: これにより、ダイアログがカレントワーキングディレクトリを変更することに関連する（ビルトインの）回避策が不要になります。

source: This replaces "#KeyHistory N".
ja: これは「#KeyHistory N」に置き換わるものです。

source: This replaces ComObjParameter(vt, value), ComObject(vt, value) and any other names that were used with a variant type and value as parameters.
ja: これは、ComObjParameter(vt, value)、ComObject(vt, value)、およびパラメータとしてバリアント型と 値を使用していた他の名前を置き換えます。

source: This replaces *c (see ClipboardAll).
ja: これは*c（ClipboardAllを参照）を置き換えるものです。

source: This replaces *c (see ClipboardAll in the documentation).
ja: これは*c（ドキュメントのClipboardAllを参照）を置き換えるものです。

source: This replaces the extension plus preceding full-stop, with .exe in the actual script name.
ja: これは、実際のスクリプト名では、拡張子とその前の完全停止を.exeに置き換えます。

source: This requires AutoHotkey to be installed under Program Files.
ja: そのため、AutoHotkeyがProgram Filesの下にインストールされている必要があります。

source: This requires the caller to pass a VarRef, and allows the function itself to "dereference" the VarRef by just referring to the parameter (without percent signs).
ja: これは、呼び出し側がVarRefを渡す必要があり、関数自身がパラメータを参照するだけで（パーセント記号なしで）VarRefを「参照解除」できるようにします。

source: This same is true for Send when SendMode Input is in effect.
ja: これは、SendMode Inputが有効な場合のSendも同様である。

source: This saves repeating the window title, which saves a little of your time, makes the script easier to update if the window title needs to be changed, and might make the code easier to read.
ja: これにより、ウィンドウのタイトルを繰り返す必要がなくなり、時間の節約になり、ウィンドウのタイトルを変更する必要がある場合にスクリプトを更新しやすくなり、コードを読みやすくすることができます。

source: This script assigns a hotkey of your choice to hide any window so that it becomes an entry at the bottom of the script's tray menu.
ja: このスクリプトは、任意のウィンドウを非表示にするホットキーを割り当てて、スクリプトのトレイメニューの一番下のエントリになるようにします。

source: This script assigns hotkeys of your choice to raise and lower the master volume.
ja: このスクリプトは、マスターボリュームの上げ下げにお好みのホットキーを割り当てます。

source: This script converts a controller (gamepad, joystick, etc.) into a three-button mouse.
ja: このスクリプトは、コントローラー（ゲームパッド、ジョイスティックなど）を3ボタンマウスに変換する。

source: This script creates a mock keyboard at the bottom of your screen that shows the keys you are pressing in real time.
ja: このスクリプトは、画面の下に模擬キーボードを作成し、押しているキーをリアルタイムで表示します。

source: This script displays a popup menu in response to briefly holding down the middle mouse button.
ja: このスクリプトは、マウスの中ボタンを短く押し続けると、ポップアップメニューを表示する。

source: This script extends that so that any point inside a window can be dragged.
ja: このスクリプトはそれを拡張し、ウィンドウ内の任意のポイントをドラッグできるようにしたものだ。

source: This script helps determine the button numbers and other attributes of your controller (gamepad, joystick, etc.).
ja: このスクリプトは、コントローラー（ゲームパッド、ジョイスティックなど）のボタン番号やその他の属性を決定するのに役立ちます。

source: This script is executed automatically and most command line switches are passed to the script instead of being interpreted by the program.
ja: このスクリプトは自動的に実行され、ほとんどのコマンドラインスイッチはプログラムによって解釈されるのではなく、スクリプトに渡される。

source: This script makes Ctrl+2 (or another hotkey of your choice) show the help file page for the selected AutoHotkey function or keyword.
ja: このスクリプトは、Ctrl+2（またはお好みの他のホットキー）で、選択したAutoHotkey関数またはキーワードのヘルプファイルページを表示します。

source: This script makes it much easier to move or resize a window:
ja: このスクリプトを使えば、ウィンドウの移動やサイズ変更がとても簡単になる：

source: This script makes it much easier to move or resize a window: 1) Hold down Alt and LEFT-click anywhere inside a window to drag it to a new location; 2) Hold down Alt and RIGHT-click-drag anywhere inside a window to easily resize it; 3) Press Alt twice, but before releasing it the second time, left-click to minimize the window under the mouse cursor, right-click to maximize it, or middle-click to close it.
ja: このスクリプトを使えば、ウィンドウの移動やサイズ変更がとても簡単になる：1) Altを押しながらウィンドウ内の任意の場所を左クリックし、新しい場所にドラッグする。2) Altを押しながらウィンドウ内の任意の場所を右クリック・ドラッグし、ウィンドウのサイズを簡単に変更する。3) Altを2回押し、2回目を離す前にマウスカーソル下のウィンドウを左クリックで最小化、右クリックで最大化、または中クリックで閉じる。

source: This script makes mousing with your keyboard almost as easy as using a real mouse (maybe even easier for some tasks).
ja: このスクリプトを使えば、キーボードでマウスを操作するのが本物のマウスを使うのと同じくらい簡単になる（作業によってはもっと簡単になるかもしれない）。

source: This script receives notifications from WinLIRC whenever you press a button on your remote control.
ja: このスクリプトは、リモコンのボタンを押すたびにWinLIRCから通知を受け取る。

source: This script reduces a window to its title bar and then back to its original size by pressing a single hotkey.
ja: このスクリプトは、1つのホットキーを押すだけで、ウィンドウをタイトルバーまで縮小し、元のサイズに戻します。

source: This script watches while you edit an AutoHotkey script.
ja: このスクリプトは、あなたがAutoHotkeyスクリプトを編集している間、監視します。

source: This second variable can then be used to assign a value to the target variable indirectly, using a double reference.
ja: そして、この第2変数を用いて、二重参照を用いて間接的に対象変数に値を代入することができる。

source: This section builds on these concepts which are covered in later sections:
ja: このセクションでは、後のセクションでカバーされるこれらの概念に基づいています。

source: This section builds on these concepts which are covered in later sections: variables, functions
ja: このセクションでは、後のセクションでカバーされるこれらの概念に基づいています：変数、関数

source: This section demonstrates how to control Winamp via hotkey even when it is minimized or inactive.
ja: このセクションでは、Winampが最小化または非アクティブの状態でもホットキーでコントロールする方法を説明します。

source: This section does not apply to COM objects.
ja: このセクションはCOMオブジェクトには適用されない。

source: This section is intended to make thoroughly clear what is believed to be a consequence of the rest of this License.
ja: このセクションは、本ライセンスの残りの部分の結果として考えられることを、徹底的に明確にすることを意図している。

source: This set of characters can be changed by editing the following example, which sets the new ending characters for all hotstrings, not just the ones beneath it:
ja: この文字のセットは、以下の例を編集することで変更できます。この例では、その下にある文字だけでなく、すべてのホットストリングに新しい終了文字を設定します。

source: This setting affects the following:
ja: この設定は、以下に影響します：

source: This setting also controls whether the ahk_class and ahk_exe criteria are interpreted as RegEx patterns.
ja: この設定は、ahk_classとahk_exe基準を RegEx パターンとして解釈するかどうかも制御する。

source: This setting is global, meaning that it affects all subsequent threads, even if this function was not called by the auto-execute thread.
ja: この設定はグローバルであり、自動実行スレッドからこの関数が呼び出されなかったとしても、後続のすべてのスレッドに影響する。

source: This setting is global, meaning that it needs to be specified only once (anywhere in the script) to affect the behavior of the entire script.
ja: この設定はスクリプト全体の動作に影響を与えるため、スクリプトの任意の場所で1回だけ指定する必要があります。

source: This setting is global, meaning that it needs to be specified only once to affect the behavior of the entire script.
ja: この設定はグローバルであり、スクリプト全体の動作に影響を与えるために一度だけ指定する必要があることを意味します。

source: This setting is ignored by blind mode and text mode; that is, the state of CapsLock is not changed in those cases.
ja: ブラインドモードと テキストモードでは、この設定は無視されます。つまり、これらの場合、CapsLockの状態は変更されません。

source: This setting is ignored unless -ReadOnly is also in effect.
ja: この設定は、-ReadOnlyも有効でない限り無視される。

source: This setting is used to control how many "instances" of a given hotkey or hotstring subroutine are allowed to exist simultaneously.
ja: この設定は、特定のホットキーまたはホットストリングのサブルーチンの「インスタンス」が同時にいくつ存在することを許可するかを制御するために使用されます。

source: This settings applies to all clipboard operations, the simplest of which are the following examples:
ja: この設定は、すべてのクリップボード操作に適用されます。最も簡単な例は次のとおりです。

source: This settings applies to all clipboard operations, the simplest of which are the following examples: Var := A_Clipboard and A_Clipboard := "New Text".
ja: この設定は、すべてのクリップボード操作に適用されます。最も簡単な例は次のとおりです：Var := A_Clipboard、A_Clipboard := "New Text"。

source: This should be used only with functions that actually return a HRESULT.
ja: これは、実際にHRESULTを返す関数にのみ使用する必要があります。

source: This should generally be omitted in cases where the buffer will be written into without first being read, as it has a time-cost proportionate to the number of bytes.
ja: バイト数に比例した時間的コストがかかるため、バッファを読み込まずに書き込むような場合には、一般に省略されるべきです。

source: This should only occur if there are encoding errors in the script file or the codepages used to save and load the file don't match.
ja: これは、スクリプトファイルにエンコーディングエラーがあるか、ファイルの保存と読み込みに使用されたコードページが一致しない場合にのみ発生するはずです。

source: This showcase lists some scripts created by different authors which show what AutoHotkey might be capable of.
ja: このショーケースには、AutoHotkeyの可能性を示す、さまざまな作者によって作成されたスクリプトがいくつかリストアップされています。

source: This signal can be caught by a Try-Catch statement.
ja: このシグナルはTry-Catch文によってキャッチすることができます。

source: This signal can be caught by a try-catch statement.
ja: このシグナルはtry-catch文によってキャッチすることができます。

source: This situation should be corrected to ensure reliable operation of the function.
ja: このような状況は、機能の確実な動作のために修正する必要があります。

source: This special command (technically called "directive") creates context-sensitive hotkeys and hotstrings.
ja: この特別な指令（専門的には「ディレクティブ」と呼ばれる）は、文脈依存のホットキーとホットストリングを作成します。

source: This special signal can only be propagated explicitly, with the maybe operator (var?).
ja: この特別なシグナルは、maybe演算子（var?）を用いて明示的にしか伝搬できなません。

source: This static method is typically inherited from the Object, Array or Map class.
ja: この静的メソッドは、通常、Object、Array、Mapクラスから継承されます。

source: This string is a subset of RASHDOC, where each letter means the following:
ja: この文字列はRASHDOCのサブセットで、各文字は次のような意味を持っています：

source: This string is a subset of RASHNDOCT, where each letter means the following:
ja: この文字列はRASHNDOCTの部分集合で、各文字は次のような意味を持っています：

source: This string is a subset of RASHNDOCTL, where each letter means the following:
ja: この文字列はRASHNDOCTLの部分集合で、各文字は次のような意味を持っています：

source: This string should not be treated as a number (one should not perform math on it or compare it numerically).
ja: この文字列を数値として扱ってはいけない（数値計算をしたり、数値で比較したりしてはいけない）。

source: This string should not be treated as a number, i.e. one should not perform math on it or compare it numerically.
ja: この文字列は数値として扱えません。つまり計算したり、数として比較はできません。

source: This stuff (indentation) is very important!
ja: このこと（インデント）はとても重要だ！

source: This style also enables hot tracking in the list-view control.
ja: このスタイルでは、リストビューコントロールでのホットトラッキングも可能です。

source: This style applies to all styles of list-view control.
ja: このスタイルは、リストビューコントロールのすべてのスタイルに適用されます。

source: This style can be used if clicking a column header in report view does not carry out an action, such as sorting.
ja: このスタイルは、レポートビューで列ヘッダーをクリックしても、並べ替えなどのアクションが実行されない場合に使用できます。

source: This style can only be used with the TCS_FIXEDWIDTH style, and it implies the TCS_FORCEICONLEFT style.
ja: このスタイルはTCS_FIXEDWIDTHスタイルでのみ使用でき、TCS_FORCEICONLEFTスタイルを意味する。

source: This style can only be used with the TCS_FIXEDWIDTH style.
ja: このスタイルは、TCS_FIXEDWIDTHスタイルでのみ使用できる。

source: This style cannot be combined with the TCS_RIGHTJUSTIFY style.
ja: このスタイルはTCS_RIGHTJUSTIFYスタイルと組み合わせることはできない。

source: This style cannot be used in conjunction with the TVS_HASLINES style.
ja: このスタイルはTVS_HASLINESスタイルと併用することはできない。

source: This style cannot be used with the WS_CHILD style.
ja: このスタイルはWS_CHILDスタイルとは併用できません。

source: This style cannot be used with the WS_POPUP style.
ja: このスタイルはWS_POPUPスタイルとは併用できません。

source: This style enables the use of the same image lists with multiple list-view controls.
ja: このスタイルでは、複数のリストビューコントロールで同じ画像リストを使用することができます。

source: This style has no effect on a single-line edit control.
ja: このスタイルは単一行のエディットコントロールには効果がありません。

source: This style is a numerical combination of WS_BORDER and WS_DLGFRAME.
ja: このスタイルはWS_BORDERと WS_DLGFRAMEを数値で組み合わせたものです。

source: This style is automatically applied to manage the "only one at a time" behavior of radio buttons.
ja: このスタイルは、ラジオボタンの「一度に1つだけ」の動作を管理するために自動的に適用されます。

source: This style is available only in conjunction with the LVS_REPORT style.
ja: このスタイルは、LVS_REPORTスタイルと組み合わせてのみ使用できる。

source: This style is most useful for combo boxes that contain file names.
ja: このスタイルは、ファイル名を含むコンボボックスに最も有効です。

source: This style is most useful for edit controls that contain file names.
ja: このスタイルは、ファイル名を含むエディットコントロールに最も有効である。

source: This style is not compatible with the LVS_LIST or LVS_REPORT styles.
ja: このスタイルはLVS_LISTや LVS_REPORTスタイルとは互換性がない。

source: This style is only available to list-view controls that use the LVS_ICON style.
ja: このスタイルは、LVS_ICONスタイルを使用するリストビューコントロールでのみ使用可能です。

source: This style is only available to list-view controls that use the LVS_REPORT style.
ja: このスタイルは、LVS_REPORTスタイルを使用するリストビューコントロールでのみ使用できます。

source: This style is the default.
ja: 初期値はこのスタイルです。

source: This style is typically used to indicate an ongoing operation whose completion time is unknown.
ja: このスタイルは通常、完了時間が不明な進行中のオペレーションを示すために使われる。

source: This style is useful for enabling the user to quickly select the most likely option.
ja: このスタイルは、ユーザーが最も可能性の高い選択肢を素早く選択できるようにするのに便利です。

source: This style is valid only when used with the TCS_MULTILINE style.
ja: このスタイルは、TCS_MULTILINEスタイルと併用した場合のみ有効である。

source: This style must be used with the TCS_BUTTONS style.
ja: このスタイルはTCS_BUTTONSスタイルと一緒に使用しなければならない。

source: This style only affects tab controls with the TCS_BUTTONS style.
ja: このスタイルは、TCS_BUTTONSスタイルを持つタブコントロールにのみ影響する。

source: This style puts the block's opening brace on the same line as the block's controlling statement rather than underneath on a line by itself.
ja: このスタイルでは、ブロックの開始ブレースをブロックの制御文と同じ行に配置し、ブロックの下に単独で配置することはありません。

source: This style requires that LVS_EX_ONECLICKACTIVATE or LVS_EX_TWOCLICKACTIVATE also be set.
ja: このスタイルでは、LVS_EX_ONECLICKACTIVATEまたはLVS_EX_TWOCLICKACTIVATEも設定されている必要がある。

source: This style requires that LVS_EX_TWOCLICKACTIVATE be set also.
ja: このスタイルでは、LVS_EX_TWOCLICKACTIVATEも設定する必要がある。

source: This style specifies a virtual list-view control (not directly supported by AutoHotkey).
ja: このスタイルは、仮想リストビューコントロールを指定します（AutoHotkeyでは直接サポートされていません）。

source: This style will not correctly display the tabs if a custom background color or text color is in effect.
ja: カスタム背景色やカスタム文字色が有効な場合、このスタイルはタブを正しく表示しません。

source: This sub-function prevents interruptions from any timers until the current thread either ends, executes Thread "NoTimers", false, or is interrupted by another thread that allows timers (in which case timers can interrupt the interrupting thread until it finishes).
ja: このサブファンクションは、現在のスレッドが終了するか、Thread "NoTimers", falseを実行するか、タイマーを許可する他のスレッドによって割り込まれるまで（この場合、タイマーは割り込まれたスレッドが終了するまで割り込むことができる）、いかなるタイマーからの割り込みも防ぐ。

source: This switch is not supported by compiled scripts which are based on a .bin file.
ja: このスイッチは、.binファイルに基づいてコンパイルされたスクリプトではサポートされていません。

source: This syntax can also be used when calling methods or setting or retrieving properties of objects; for example, Object.Property[Params*].
ja: この構文は、メソッドの呼び出しやオブジェクトのプロパティの設定・取得の際にも使用できます。例えば、Object.Property[Params*]などです。

source: This syntax is usually used to retrieve an element of an Array or Map.
ja: この構文は、通常、Arrayや Mapの要素を取得するために使用されます。

source: This system metric is used in a Terminal Services environment.
ja: このシステム指標はターミナルサービス環境で使用されます。

source: This table shows the default function of each key on most versions of Windows.
ja: この表は、Windowsのほとんどのバージョンで、各キーのデフォルトの機能を示しています。

source: This technique also works with Focus and Check above.
ja: このテクニックは、上記のFocusや Checkとも連動しています。

source: This technique can also be used to prevent a function from being called when one of its parameters would be passed a value it considers inappropriate, such as an empty string.
ja: また、関数のパラメータに空文字列などの不適切な値が渡された場合に、その関数が呼び出されないようにすることも可能です。

source: This technique is best used with C, C++ apps.
ja: このテクニックは、CやC++のアプリで使うのが最適だ。

source: This technique should be used only for messages intended to be broadcast, such as the following example:
ja: この手法は、次の例のように、放送を目的としたメッセージにのみ使用する必要があります：

source: This technique should be used only for messages intended to be broadcast.
ja: このテクニックは、放送を目的としたメッセージにのみ使用されるべきです。

source: This text is placed on the clipboard,
ja: このテキストは、クリップボードに置かれます。

source: This text may include linefeed characters (`n) to start new lines.
ja: このテキストには、改行文字(`n)を含めることができます。

source: This the same check performed by Obj is Array; however, instances can be based on other instances, whereas is requires a Class.
ja: これは、Obj is Arrayで行われるチェックと同じです。しかし、インスタンスは他のインスタンスに基づくことができるのに対し、isはクラスを必要とします。

source: This toggles CapsLock on and off when you hold down Shift and press CapsLock.
ja: Shiftを押しながらCapsLockを押すと、CapsLockのオン/オフが切り替わります。

source: This translation typically does not affect performance.
ja: この翻訳は、通常、パフォーマンスに影響を与えません。

source: This tutorial is not meant for total newbies (no offense meant) since these functions are considered advanced features.
ja: このチュートリアルは全くの初心者向けではありません（悪意はありません）。

source: This type of function cannot be called directly, but is executed whenever the hotkey or hotstring is activated.
ja: このタイプの関数は直接呼び出すことはできませんが、ホットキーまたはホットストリングがアクティブになるたびに実行されます。

source: This type of scaling affects AutoHotkey only on systems with multiple screens where not all screens have the same DPI setting.
ja: このタイプのスケーリングは、すべてのスクリーンのDPI設定が同じでない複数のスクリーンを持つシステムでのみAutoHotkeyに影響します。

source: This typically causes the hotkeys to execute repeatedly.
ja: これにより、通常、ホットキーが繰り返し実行されることになります。

source: This typically corresponds to an array element or item within a collection, where y is the item's index or key.
ja: これは通常、コレクション内の配列要素またはアイテムに対応し、yはアイテムのインデックスまたはキーである。

source: This typically isn't needed, because Send and ControlSend automatically support Unicode text.
ja: SendとControlSendは自動的にUnicodeテキストをサポートするので、これは通常必要ありません。

source: This typically only occurs as a result of the MsgBox limit being reached, but may occur in other unusual cases.
ja: これは通常、MsgBoxの制限に達した場合にのみ発生しますが、その他の異常なケースでも発生する可能性があります。

source: This value is ignored if TVS_HASLINES is not also specified.
ja: TVS_HASLINESも指定されていない場合、この値は無視される。

source: This value is most often 1, which means the first icon.
ja: この値は、多くの場合、1であり、最初のアイコンを意味します。

source: This value should be used only for debugging purposes.
ja: この値は、デバッグの目的でのみ使用する必要があります。

source: This value will change if the current thread is interrupted by another hotkey or hotstring, so it is generally better to use the parameter ThisHotkey when available.
ja: この値は、現在のスレッドが別のホットキーやホットストリングによって中断された場合に変更されるため、一般的には、使用可能な場合はThisHotkeyパラメータを使用する方がよいでしょう。

source: This variable can be used to 'pluck' constant information from the script source, and use it in later compiler directives.
ja: この変数は、スクリプトのソースから定数情報を「抜き取り」、後のコンパイラのディレクティブで使用するために使うことができる。

source: This variable can be used to change the mask key to a key with fewer side effects.
ja: この変数を使用すると、マスクキーを副作用の少ないキーに変更することができます。

source: This variable has no effect when:
ja: この変数は、以下の場合に効果がありません：

source: This variable is directly used to call the function, but its value can also be read to retrieve the function itself, as a value.
ja: この変数は、関数を呼び出すために直接使われますが、その値を読み込むことで、関数そのものを、値として取り出すこともできます。

source: This variable will be blank if the file does not have a short name, which can happen on systems where NtfsDisable8dot3NameCreation has been set in the registry.
ja: NtfsDisable8dot3NameCreationがレジストリに設定されているシステムで起こりうることですが、ファイルに短い名前がない場合、この変数は空白となります。

source: This variable will be empty if the currently retrieved item is not a subkey (i.e. A_LoopRegType is not the word KEY).
ja: 現在検索されている項目がサブキーでない場合（すなわちA_LoopRegTypeがKEYという単語でない場合）、この変数は空となります。

source: This virtual key is then mapped to a scan code as described above.
ja: この仮想キーは、上記のようにスキャンコードにマッピングされます。

source: This warning is disabled by default.
ja: この警告は、デフォルトでは無効になっています。

source: This was an unintuitive way to detect when GroupActivate fails to find any matching windows; GroupActivate's return value should be used instead.
ja: これは、GroupActivateが一致するウィンドウを見つけられなかった場合に検出するための直感的でない方法でした。GroupActivateの戻り値を代わりに使用する必要があります。

source: This was done by calling SystemParametersInfo with the SPI_SETFOREGROUNDLOCKTIMEOUT action, which affects all applications for the current user session.
ja: これは、SPI_SETFOREGROUNDLOCKTIMEOUTアクションでSystemParametersInfoを呼び出すことによって行われ、現在のユーザーセッションのすべてのアプリケーションに影響します。
